# ZoneHumidificationSetPointParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZoneHumidificationSetPointParam Property
ParameterTypeId Class See Also
---
"Humidification Set Point"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZoneHumidificationSetPointParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneHumidificationSetPointParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZoneHumidificationSetPointParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace